RSN/src/Catalogs/RJM_НастройкаЭлектронногоАдресаСервера/RJM_НастройкаЭлектронногоАдресаСервера.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>RJM_НастройкаЭлектронногоАдресаСервера</name>
  <attributes>
    <name>НастройкаПочты</name>
    <type>
      <types>CatalogRef.RJM_НастройкаПочты</types>
    </type>
  </attributes>
  <attributes>
    <name>SMPTАутентификация</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ЛогинSMTP</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>ПарольSMTP</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>ПочтаПодсистемы</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ШаблонТемы</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>ШаблонТекста</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>ИмяОтправителя</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>100</length>
      </stringQualifiers>
    </type>
  </attributes>
</mdclass:Catalog>

RSN/src/Catalogs/RJM_НастройкаЭлектронногоАдресаСервера/Forms/ФормаЭлемента/Module.bsl
&НаКлиенте
Процедура ПриОткрытии(Отказ)
	Элементы.ЛогинSMTP.Доступность = ?(Объект.SMPTАутентификация, Истина, Ложь);
	Элементы.ПарольSMTP.Доступность = ?(Объект.SMPTАутентификация, Истина, Ложь);
КонецПроцедуры

&НаКлиенте
Процедура SMPTАутентификацияПриИзменении(Элемент)
	Элементы.ЛогинSMTP.Доступность = ?(Объект.SMPTАутентификация, Истина, Ложь);
	Элементы.ПарольSMTP.Доступность = ?(Объект.SMPTАутентификация, Истина, Ложь);
КонецПроцедуры
